#!/bin/bash
#while 嵌套
a () {
for((;a>=0;a--))
do
    if [ $a -eq 8 ]
    then
		continue
    fi
    if [ $a -eq 5 ]
    then
        break
    fi
    echo $a
done
}
#九九乘法口决
clear
echo -e "\033[31m 99乘法口诀 \033[0m"
echo "*******************************************************************************************************"
for((i=1;i<10;i++))
do
	for((j=0;j<=i;j++))
    do	
		echo -n -e "\033[31m$i*$j=\033[0m \033[32m$(($i*$j))\033[0m\t"
    sleep 1s
	done
    echo -e 
done
echo "*******************************************************************************************************"
